In [21]:
import numpy as np
import pandas as pd

In [22]:
#importing the Datasets
match_sum = pd.read_csv(r'C:\CS\Data science\codebasics\C_10_ipl\datasets\dim_match_summary.csv')
players = pd.read_csv(r'C:\CS\Data science\codebasics\C_10_ipl\datasets\dim_players.csv')
bat_sum = pd.read_csv(r'C:\CS\Data science\codebasics\C_10_ipl\datasets\fact_bating_summary.csv')
bowl_sum = pd.read_csv(r'C:\CS\Data science\codebasics\C_10_ipl\datasets\fact_bowling_summary.csv')

In [23]:
match_sum.shape,players.shape,bat_sum.shape,bowl_sum.shape

((206, 6), (292, 5), (3268, 11), (2436, 14))

In [24]:
match_sum.head(2)

         team1 team2       winner     margin     matchDate match_id
0  Super Kings   KKR  Super Kings    27 runs  Oct 15, 2021  T203817
1     Capitals   KKR          KKR  3 wickets  Oct 13, 2021  T206442

In [25]:
players.head(2)

,name,team,battingStyle,bowlingStyle,playingRole
0,RuturajGaikwad,Super Kings,Right hand Bat,Right arm Offbreak,Batter
1,FafduPlessis,Super Kings,Right hand Bat,Legbreak,Middle order Batter

In [26]:
bat_sum.head(2)

,match_id,match,teamInnings,battingPos,batsmanName,out/not_out,runs,balls,4s,6s,SR
0,T203817,Super Kings Vs KKR,Super Kings,1,RuturajGaikwad,out,32,27,3,1,118.51
1,T203817,Super Kings Vs KKR,Super Kings,2,FafduPlessis,out,86,59,7,3,145.76

In [27]:
bowl_sum.head(2)

,match_id,match,bowlingTeam,bowlerName,overs,maiden,runs,wickets,economy,0s,4s,6s,wides,noBalls
0,T203817,Super Kings Vs KKR,KKR,ShakibAlHasan,3.0,0,33,0,11.0,6,2,3,0,0
1,T203817,Super Kings Vs KKR,KKR,ShivamMavi,4.0,0,32,1,8.0,8,1,2,0,0

In [28]:
print('match sum columns are' , match_sum.columns)

match sum columns are Index(['team1', 'team2', 'winner', 'margin', 'matchDate', 'match_id'], dtype='object')

In [29]:
print('players sum columns are' ,players.columns)

players sum columns are Index(['name', 'team', 'battingStyle', 'bowlingStyle', 'playingRole'], dtype='object')

In [30]:
print('batsmen sum columns are' ,bat_sum.columns)

batsmen sum columns are Index(['match_id', 'match', 'teamInnings', 'battingPos', 'batsmanName',
       'out/not_out', 'runs', 'balls', '4s', '6s', 'SR'],
      dtype='object')

In [31]:
print('bowler sum columns are' ,bowl_sum.columns)

bowler sum columns are Index(['match_id', 'match', 'bowlingTeam', 'bowlerName', 'overs', 'maiden',
       'runs', 'wickets', 'economy', '0s', '4s', '6s', 'wides', 'noBalls'],
      dtype='object')

In [32]:
tot_runs_per_player = bat_sum.groupby(by=['batsmanName'])[['runs']].sum()
tot_runs_per_player.sort_values(by=['runs'],ascending=False).head(10)

                 runs
batsmanName
ShubmanGill      1851
FafduPlessis     1831
RuturajGaikwad   1593
KLRahul          1516
JosButtler       1509
ShikharDhawan    1392
ViratKohli       1385
SanjuSamson      1304
SuryakumarYadav  1225
GlennMaxwell     1214

In [33]:
tot_runs_per_player.sort_values(by=['runs'],ascending=False,ignore_index=True).head(10)

   runs
0  1851
1  1831
2  1593
3  1516
4  1509
5  1392
6  1385
7  1304
8  1225
9  1214

In [34]:
type(bat_sum.groupby(by=['batsmanName'])['runs'].sum())

pandas.core.series.Series

In [35]:
type(bat_sum.groupby(by=['batsmanName'])[['runs']].sum())

pandas.core.frame.DataFrame

In [36]:
type(tot_runs_per_player)

pandas.core.frame.DataFrame

In [37]:
type(tot_runs_per_player.reset_index())

pandas.core.frame.DataFrame

In [38]:
tot_runs_per_player.index

Index(['ABdeVilliers', 'AaronFinch', 'AbdulBasith', 'AbdulSamad',
       'AbhijeetTomar', 'AbhinavManohar', 'AbhishekSharma', 'AbishekPorel',
       'AdamMilne', 'AdamZampa',
       ...
       'VivrantSharma', 'WaninduHasaranga', 'WashingtonSundar', 'WayneParnell',
       'WriddhimanSaha', 'YashDayal', 'YashDhull', 'YashasviJaiswal',
       'YudhvirSingh', 'YuzvendraChahal'],
      dtype='object', name='batsmanName', length=264)

In [39]:
tot_runs_per_player.reset_index().index

RangeIndex(start=0, stop=264, step=1)

In [40]:
tot_runs_per_player.reset_index()

         batsmanName  runs
0       ABdeVilliers   313
1         AaronFinch    86
2        AbdulBasith     1
3         AbdulSamad   284
4      AbhijeetTomar     4
..               ...   ...
259        YashDayal     0
260        YashDhull    16
261  YashasviJaiswal  1132
262     YudhvirSingh     1
263  YuzvendraChahal    15

[264 rows x 2 columns]

In [41]:
dic = {'runs':np.sum,'4s':np.sum,'6s':np.sum}
bat_boundary =  bat_sum.groupby(by=['batsmanName']).agg(dic)
bat_boundary.head(2)

              runs  4s  6s
batsmanName
ABdeVilliers   313  23  16
AaronFinch      86  10   3

In [44]:
bat_boundary['runs_by_4s&6s'] = (bat_boundary['4s'] * 4) + (bat_boundary['6s'] * 6)
bat_boundary['boundary %'] = round((bat_boundary['runs_by_4s&6s']/bat_boundary['runs']) * 100,2)
print(type(bat_boundary.sort_values(by=['boundary %'],ascending=False)['boundary %']))
print("below is a series with batsmanName as the index")
bat_boundary.sort_values(by=['boundary %'],ascending=False)['boundary %']

<class 'pandas.core.series.Series'>
below is a series with batsmanName as the index

batsmanName
LittonDas          100.00
AbhijeetTomar      100.00
MarkWood            90.91
SanvirSingh         90.91
ShreyasGopal        87.50
                    ...
ShahbazNadeem         NaN
TNatarajan            NaN
TusharDeshpande       NaN
TymalMills            NaN
YashDayal             NaN
Name: boundary %, Length: 264, dtype: float64